Repository: arkarwinuit/org_auth_ui_dev
Catalog: lib/l10n/app_*.arb
Languages: my

# signInTitle
source: Sign In
my: စာရင်းဝင်ပါ

# signInSubTitle
source: Please enter your details below to continue
my: ဆက်လက်လုပ်ဆောင်ရန် သင့်အချက်အလက်များထည့်ပါ

# phoneNumberLabel
source: Phone Number
my: ဖုန်းနံပါတ်

# emailLabel
source: Email
my: အီးမေးလ်

# passwordLabel
source: Password
my: လျှို့ဝှက်နံပါတ်

# signInButton
source: Continue
my: ဆက်လုပ်မည်

# signUpButton
source: Sign Up
my: အကောင့်ပြုလုပ်ပါ

# haveNoAccount
source: Don't have an account? |
my: အကောင့်မရှိလျှင် |

source: or
my: (သို့မဟုတ်)

# signInWithPhone
source: Sign In With Phone Number
my: ဖုန်းနံပါတ်ဖြင့်ဝင်မည်

source: Sign In With Email
my: အီးမေးလ်ဖြင့်ဝင်မည်

# phoneempty
source: Phone Number cannot be empty
my: ဖုန်းနံပါတ်ထည့်ပေးရန်လိုပါသည်

# phoneinvalid
source: Phone Number is invalid
my: ဖုန်းနံပါတ်မှားနေပါသည်

# emailempty
source: Email cannot be empty
my: အီးမေးလ်ထည့်ပေးရန်လိုပါသည်

# emailinvalid
source: Email is invalid
my: အီးမေးလ်မှားနေပါသည်

# passwordempty
source: Password cannot be empty
my: လျှို့ဝှက်နံပါတ်ထည့်ပေးရန်လိုပါသည်

# passwordinvalid
source: Password is invalid
my: လျှို့ဝှက်နံပါတ်မှားနေပါသည်

# signUpTitle
source: Register
my: အကောင့်ပြုလုပ်ပါ

# nameLabel
source: Name
my: အမည်

# passportRadio
source: Passport
my: နိုင်ငံကူးလက်မှတ်

# nrcRadio
source: NRC
my: နိုင်ငံသား မှတ်ပုံတင်

# passportLabel
source: Passport Number
my: နိုင်ငံကူးလက်မှတ် နံပါတ်

# nrcLabel
source: NRC Number
my: မှတ်ပုံတင် နံပါတ်

# dobLabel
source: Date of Birth
my: မွေးနေ့

# continueLabel
source: Continue
my: ဆက်သွားမည်မည်

source: Register with Phone
my: ဖုန်းနှင့် အကောင့်ပြုလုပ်မည်

source: Register with Email
my: အီးမေးလ်နှင့် အကောင့်ပြုလုပ်မည်

# nameempty
source: Name cannot be empty
my: အမည်ထည့်ပေးရန်လိုပါသည်

# nametoolong
source: Name cannot exceed 70 characters
my: အမည်က အလုံးရေ ၇၀ ထက်ကျော်နေပါသည်

# emailtoolong
source: Email cannot exceed 50 characters
my: အီးမေးလ်က အလုံးရေ ၅၀ ထက်ကျော်နေပါသည်

# passwordtooshort
source: Password must be at least 6 characters
my: လျှို့ဝှက်နံပါတ်က အလုံးရေ ၆ နှင့် အထက် ရှိရပါမည်

# confirmpasswordempty
source: Please confirm your password
my: လျှို့ဝှက်နံပါတ်က အလုံးရေ ၆ ထက်ကျော်နေပါသည်

# passwordmismatch
source: Passwords do not match
my: လျှို့ဝှက်နံပါတ် ၂ခုသည် မတူနေပါ

source: Required
my: ထည့်ရန်လိုအပ်သည်

# nrcnumberinvalid
source: NRC number must be exactly 6 digits
my: မှတ်ပုံတင်အမှတ် က ၆လုံးဖြစ်ရပါမယ်

# passportnumberinvalid
source: Invalid passport number format
my: ပတ်စပို့ အမှတ်က မှားယွင်းနေပါသည်

# phoneinvalidshort
source: Please type valid phone number
my: ဖုန်းနံပါတ်မှားနေပါသည်
